🚀&nbsp; env0 had composed a PR Plan for environment [Compass Demo Account / FrontEnd Servers - Drifted ](https://app.env0.com/p/695bce46-194c-4fc2-a42c-a40f61474310/environments/6fe34b40-ef49-45c9-9e43-1331c080fa19?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:


  # module.acme-ec2.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-057439a71140a950c" -> "ami-0a15226b1f7f23580" # forces replacement
!       arn                                  = "arn:aws:ec2:us-west-2:326535729404:instance/i-06a56465c50171e3a" -> (known after apply)
!       availability_zone                    = "us-west-2a" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
!       id                                   = "i-06a56465c50171e3a" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       instance_type                        = "t3a.small" -> "t3a.micro"
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       key_name                             = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       primary_network_interface_id         = "eni-0a289a20d3272cec0" -> (known after apply)
!       private_dns                          = "ip-172-32-23-72.us-west-2.compute.internal" -> (known after apply)
!       private_ip                           = "172.32.23.72" -> (known after apply)
!       public_dns                           = "ec2-34-219-206-234.us-west-2.compute.amazonaws.com" -> (known after apply)
!       public_ip                            = "34.219.206.234" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
!       tags                                 = {
!           "Demo"      = "March 18" -> "May 20"
+           "DiskCount" = "three"
            "Name"      = "acme-frontend-drift-cause-test"
            "Owner"     = "acme demo org"
            "Terraform" = "true"
            "Test"      = "new taga"
        }
!       tags_all                             = {
!           "Demo"      = "March 18" -> "May 20"
+           "DiskCount" = "three"
            # (4 unchanged elements hidden)
        }
!       vpc_security_group_ids               = [
-           "sg-02f4a89f8b797a3da",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

!       ebs_block_device {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       enclave_options {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       ephemeral_block_device {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       metadata_options {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       network_interface {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       root_block_device {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   instances  = [
-       "i-06a56465c50171e3a",
+       (known after apply),
    ]
!   private_ip = [
-       "172.32.23.72",
+       (known after apply),
    ]
!   public_ip  = [
-       "34.219.206.234",
+       (known after apply),
    ]
```
</details>


```
Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  -$7 ($15 → $8)
Percent: -47%
```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: env0/acme-demo/.env0workdir/env0_tf_plan.json

! module.acme-ec2.aws_instance.this[0]
  -$7 ($15 → $8)

!     Instance usage (Linux/UNIX, on-demand, t3a.small → t3a.micro)
      -$7 ($14 → $7)

Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  -$7 ($15 → $8)
Percent: -47%

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

1 cloud resource was detected:
∙ 1 was estimated

Infracost estimate: Monthly estimate decreased by $7 ↓
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ env0/acme-demo/.env0workdir/env0_tf_plan.json      ┃           -$7 ┃           - ┃   -$7 (-47%) ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/695bce46-194c-4fc2-a42c-a40f61474310/environments/6fe34b40-ef49-45c9-9e43-1331c080fa19/deployments/c66f1926-fe5b-44cd-b563-c74efaa4f748?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92)

[![env0-ai-summary-banner](https://app.env0.com/images/vcs-comment-ai-summary-banner.png)](https://app.env0.com/p/695bce46-194c-4fc2-a42c-a40f61474310/environments/6fe34b40-ef49-45c9-9e43-1331c080fa19/deployments/c66f1926-fe5b-44cd-b563-c74efaa4f748?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92&ai-analyzer=plan-summary)